Repository: DoctorMarvin21/RandomAlgebra
Catalog: Sources/RandomAlgebra/Resources/RandomAlgebra.*.resx
Languages: ru

# ArgumentSpecifiedSeveralTimes
source: "{0}" argument specified several times
ru: "{0}" задан несколько раз

# CorrelationMustBeInRangeFromMinusOneToOne
source: Correlation must be in range (-1, 1)
ru: Коэффициент корреляции должен лежать в диапазоне (-1, 1)

# CorrelationParamtersIgnored
source: Some of correlation parameters was ignored, rebuild the expression
ru: Некоторые параметры корреляция были проигнорированы, перестройте выражение

# CovarianceMatrixMustBePositiveDefined
source: Covariance matrix must be positive-definite
ru: Матрица ковариации должна быть положительно определенной

source: Covariance matrix must be square
ru: Матрица ковариации должна быть квадратной

source: Covariance matrix must be symmetric
ru: Матрица ковариации должна быть симметричной

source: Degrees of freedom must be greater then zero
ru: Число степеней свободы должно быть больше нуля

# DegreesOfFreedomMustNotBeLessThenOne
source: Degrees of freedom must not be less then 1
ru: Число степеней свободы должно быть не меньше 1

source: Division by zero
ru: Деление на 0

# DivisionByZeroCrossingRandom
source: Division by random that takes zero value
ru: Делении на случайную величину, принимающую значение 0

# DivisionOfZero
source: Division of zero by random
ru: Деление 0 на случайную величину

# ExponentialOfNegativeInRandomPower
source: Rising negative number to random power
ru: Возведение отрицательного числа в степень случайной величины

# ExponentialOfNotPositiveRandomInIrrationalPower
source: Raising non-positive random variable to a non-natural power
ru: Возведение случайной величины, принимающей отрицательные значения, в не натуральную степень

# ExponentialOfOneInRandomPower
source: Rising one to random power
ru: Возведение 1 в степень случайной величины

# ExponentialOfRandomInZeroPower
source: Raising the random variable to the zero power
ru: Возведение случайной величины в степень 0

# ExponentialOfZeroCrossingRandomInNegativePower
source: Rasing random variable that takes zero to negative power
ru: Возведение случайной величины, принимающей значение 0, в отрицательную степень

# ExponentialOfZeroInRandomPower
source: Rising zero to random power
ru: Возведение 0 в степень случайной величины

# ExpressionOpreatorsInconsistent
source: Expression operators are inconsistent
ru: Операторы выражения несогласованы

# ForCorrelationPairBothOfDistributionsMustBeContinuous
source: For correlation pair both if distributions must be continuous
ru: Для коррелирующей пары оба распределения должны быть непрерывными

# ForCorrelationPairMultivariateDistributionMustBeTwoDimensional
source: To build correlation pair multivariate distribution must be two-dimentional
ru: Для построения коррелирующей пары многомерное распределение должно быть двумерным

# ImpossibeToUseRandomAlgebraParameterSetMoreThenOnce
source: It is impossible to perform the propagation by the method of algebra of random variables, since the parameter "{0}" occurs more than once
ru: Невозможно выполнить транформацию методом алгебры случайных величин, так как параметр "{0}" встречается более одного раза

# LengthOfArgumentsMustBeEqualToLengthOfParameters
source: The number of arguments {0} does not match the number of parameters {1}
ru: Число аргументов {0} не соответствует числу параметров {1}

source: Length of arguments must be equal to length of values
ru: Длины массивов аргументов и значений должны совпадать

# LengthOfArgumentsMustBeGreaterThenTwo
source: Length of arguments must be greater then 2
ru: Длина массива аргументов должна быть больше 2

# LengthOfValuesMustBeGreaterThenTwo
source: Length of values must be greater then 2
ru: Длина массива значений должна быть больше 2

# LogarithmOfNegativeValue
source: Logarithm of a negative number
ru: Логарифм от отрицательного числа

# LogarithmOfNotPositiveRandom
source: Logarithm of non-positive or taking zero random value
ru: Логарифм от случайной величины, принимающей отрицательные значения или 0

# LogarithmOfZeroValue
source: Logarithm of zero
ru: Логарифм от 0

source: Logarithm with negative base
ru: Логарифм по отрицательному основанию

# LogarithmWithNotPositiveRandomBase
source: Logarithm with non-positive or taking zero random value base
ru: Логарифм по основанию случайной величины, принимающей отрицательные значения или 0

# LogarithmWithOneBase
source: Logarithm with base one
ru: Логарифм по основанию 1

# LogarithmWithOneCrossingRandomBase
source: Logarithm with taking one random value base
ru: Логарифм по основанию случайной величины, принимающей значение 1

source: Logarithm with zero base
ru: Логарифм по основанию 0

source: Lower bound is greater then upper bound
ru: Нижняя граница больше верхней границы

source: Missing expression
ru: Выражение не задано

# MultiplyRandomByZero
source: Multiplying a random value by zero
ru: Умножение случайной величины на 0

source: Negative step
ru: Отрицательный шаг

# NumberOfExperimentsMustBeGreaterThenTwo
source: Number of experiments must be greater then 2
ru: Число экспериментов должно быть больше 2

# NumberOfPocketsMustBeGreaterThenTwo
source: Number of pockets must be greater then 2
ru: Число карманов должно быть больше 2

# ParameterValueIsMissing
source: Parameter value "{0}" is missing
ru: Отсутствует значение параметра "{0}"

# ProbabilityMustBeInRangeFromZeroToOne
source: Probability must be in range [0, 1]
ru: Вероятность должна находиться в пределах от 0 до 1

source: Rate parameter must be greater then zero
ru: Интенсивность должна быть больше 0

# SamplesNumberMustBeGreaterThenTwo
source: Samples number must be greater than 2
ru: Число отсчетов должно быть положительным числом больше 2

source: Scale parameter must be greater then zero
ru: Параметр масштаба должен быть больше 0

# ShapeParameterAMustBeGreaterThenZero
source: Shape parameter α must be greater then zero
ru: Параметр формы α должен быть больше 0

# ShapeParameterBMustBeGreaterThenZero
source: Shape parameter β must be greater then zero
ru: Параметр формы β должен быть больше 0

source: Shape parameter must be greater then zero
ru: Параметр формы должен быть больше 0

source: Standard deviation must be greater then zero
ru: Стандартное отклонение должно быть больше 0

# StandardDeviationOfFirstDistributionMustBeGreaterThenZero
source: Standard deviation of 1-st distribution must be greater then zero
ru: Стандартное отклонение 1 должно быть больше 0

# StandardDeviationOfSecondDistributionMustBeGreaterThenZero
source: Standard deviation of 2-nd distribution must be greater then zero
ru: Стандартное отклонение 2 должно быть больше 0

# TangentOfValueCrossingAsymptote
source: Tangent of random value crssing asymptote
ru: Тангенс от случайной величины пересекающей асимптоту

# UnknownSymbolInExpression
source: Unknown symbol "{0}" in expression "{1}"
ru: Неизвестный символ "{0}" в выражении "{1}"

# VectorOfCoeffitientsMustBeEqualToDimension
source: Vector of coefficients length is not equals to dimension of covariance matrix
ru: Длина вектора средних значений не совпадает с размерностью матрицы

# VectorOfMeansMustBeEqualToDimension
source: Vector of means length is not equals to dimension of covariance matrix
ru: Длина вектора средних значений не совпадает с размерностью матрицы
